#define F_CPU 1000000UL // принудительно задаем частоту
#include <avr/io.h>


int main(void)
{
    DDRD = 0b11111111;
    PORTD = 0b00000000;
    
    TCCR2 |= (1 << 2) | (1 << 1) | (1 << 0);  // инициализируем предделитель на 64
    TCNT2 = 0; // обнуляем счетчик
    
    int x = 0;

    while (1) 
    {
        if (TCNT2 == 1)                                                                 
        {
            x++;
            TCNT2 = 0;
        }
        if (x == 488)  // при заполнении счетчика на половину
        {
            PORTD = 0b00001111;
        }
        if (x == 976)
        {
        	PORTD = 0b11110000;
        	x = 0;
        }
    }
}