#define F_CPU 1000000UL // принудительно задаем частоту
#include <avr/io.h>


int main(void)
{
    DDRD = 0b11111111;
    PORTD = 0b00000000;
    
    TCCR2 |= (1 << 2);  // инициализируем предделитель на 64
    
    TCNT2 = 0; // обнуляем счетчик
    
    while (1) 
    {
        if (TCNT2 == 0)                                                                 
        {
            PORTD = 0b00001111;
        }
        if (TCNT2 == 128)  // при заполнении счетчика на половину
        {
            PORTD = 0b11110000;
        }
    }
}